#include <avr/interrupt.h>
#include <avr/io.h>
#include <avr/pgmspace.h>

#define LUT_ZERO_LEVEL 127
#define SIN_LENGTH 256

#define F_CPU 16000000UL
#define PRESCALER_VALUE 8
#define TIMER_CLOCK (F_CPU / PRESCALER_VALUE)

//注意: これでモータを実際に駆動しないように！

const uint8_t SIN_U[SIN_LENGTH] PROGMEM = { 127, 130, 133, 136, 139, 142, 145, 148, 151, 154, 157, 160, 163, 166, 169, 172, 175, 178, 181, 184, 186, 189, 192, 194, 197, 200, 202, 205, 207,
                                            209, 212, 214, 216, 218, 221, 223, 225, 227, 229, 230, 232, 234, 235, 237, 239, 240, 241, 243, 244, 245, 246, 247, 248, 249, 250, 250, 251, 252,
                                            252, 253, 253, 253, 253, 253, 254, 253, 253, 253, 253, 253, 252, 252, 251, 250, 250, 249, 248, 247, 246, 245, 244, 243, 241, 240, 239, 237, 235,
                                            234, 232, 230, 229, 227, 225, 223, 221, 218, 216, 214, 212, 209, 207, 205, 202, 200, 197, 194, 192, 189, 186, 184, 181, 178, 175, 172, 169, 166,
                                            163, 160, 157, 154, 151, 148, 145, 142, 139, 136, 133, 130, 127, 123, 120, 117, 114, 111, 108, 105, 102, 99, 96, 93, 90, 87, 84, 81, 78,
                                            75, 72, 69, 67, 64, 61, 59, 56, 53, 51, 48, 46, 44, 41, 39, 37, 35, 32, 30, 28, 26, 24, 23, 21, 19, 18, 16, 14, 13,
                                            12, 10, 9, 8, 7, 6, 5, 4, 3, 3, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 3, 3,
                                            4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 16, 18, 19, 21, 23, 24, 26, 28, 30, 32, 35, 37, 39, 41, 44, 46, 48, 51, 53,
                                            56, 59, 61, 64, 67, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123 };
const uint8_t SIN_V[SIN_LENGTH] PROGMEM = { 17, 15, 14, 12, 11, 10, 8, 7, 6, 5, 4, 4, 3, 2, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
                                            2, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 17, 19, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 43, 45,
                                            48, 50, 53, 55, 58, 60, 63, 66, 68, 71, 74, 77, 80, 83, 86, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 129,
                                            132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 185, 188, 191, 194, 196, 199, 201, 204, 206, 209, 211,
                                            213, 216, 218, 220, 222, 224, 226, 228, 230, 232, 233, 235, 236, 238, 239, 241, 242, 243, 245, 246, 247, 248, 249, 249, 250, 251, 251, 252, 252,
                                            253, 253, 253, 253, 253, 253, 253, 253, 253, 253, 252, 252, 251, 251, 250, 249, 248, 247, 246, 245, 244, 243, 242, 240, 239, 238, 236, 234, 233,
                                            231, 229, 227, 225, 223, 221, 219, 217, 215, 213, 210, 208, 205, 203, 200, 198, 195, 193, 190, 187, 185, 182, 179, 176, 173, 170, 167, 164, 161,
                                            158, 155, 152, 149, 146, 143, 140, 137, 134, 131, 128, 124, 121, 118, 115, 112, 109, 106, 103, 100, 97, 94, 91, 88, 85, 82, 79, 76, 73,
                                            70, 68, 65, 62, 59, 57, 54, 52, 49, 47, 44, 42, 40, 37, 35, 33, 31, 29, 27, 25, 23, 21, 20, 18 };
const uint8_t SIN_W[SIN_LENGTH] PROGMEM = { 236, 235, 233, 232, 230, 228, 226, 224, 222, 220, 218, 216, 213, 211, 209, 206, 204, 201, 199, 196, 194, 191, 188, 185, 183, 180, 177, 174, 171,
                                            168, 165, 162, 159, 156, 153, 150, 147, 144, 141, 138, 135, 132, 129, 125, 122, 119, 116, 113, 110, 107, 104, 101, 98, 95, 92, 89, 86, 83,
                                            80, 77, 74, 71, 68, 66, 63, 60, 58, 55, 53, 50, 48, 45, 43, 40, 38, 36, 34, 32, 30, 28, 26, 24, 22, 20, 19, 17, 15,
                                            14, 13, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 2, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 2,
                                            3, 4, 4, 5, 6, 7, 8, 10, 11, 12, 14, 15, 17, 18, 20, 21, 23, 25, 27, 29, 31, 33, 35, 37, 40, 42, 44, 47, 49,
                                            52, 54, 57, 59, 62, 65, 68, 70, 73, 76, 79, 82, 85, 88, 91, 94, 97, 100, 103, 106, 109, 112, 115, 118, 121, 124, 128, 131, 134,
                                            137, 140, 143, 146, 149, 152, 155, 158, 161, 164, 167, 170, 173, 176, 179, 182, 185, 187, 190, 193, 195, 198, 200, 203, 205, 208, 210, 213, 215,
                                            217, 219, 221, 223, 225, 227, 229, 231, 233, 234, 236, 238, 239, 240, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 251, 252, 252, 253, 253,
                                            253, 253, 253, 253, 253, 253, 253, 253, 252, 252, 251, 251, 250, 249, 249, 248, 247, 246, 245, 243, 242, 241, 239, 238 };

volatile uint16_t sigwave_index;            //SINテーブル参照用インデックス
volatile uint16_t sigwave_index_increment;  //SINテーブル参照用インデックスのインクリメント用
volatile uint16_t top;                      //TOP値

volatile float modulation_index = 0.0;  //信号波振幅
volatile float freq = 0;                //基本波周波数
volatile float carrier_freq = 1000;     //キャリア周波数

void setup() {
  cli();  //割り込み無効化
  sigwave_index_increment = (uint16_t)(freq / 2 / carrier_freq * SIN_LENGTH);
  top = (uint16_t)(TIMER_CLOCK / 2 / carrier_freq);
  update_duties_and_set_ocr();

  DDRB |= (1 << DDB5) | (1 << DDB6) | (1 << DDB7);  // OC1A/B/Cを出力に設定

  // TCCR1A/Bレジスタ設定
  TCCR1A = (1 << COM1A1) | (1 << COM1B1) | (1 << COM1C1);  // 次の更新はBOTTOM（谷）
  TCCR1B = (1 << WGM13) | (1 << CS11);                     // 位相基準PWM（TOP=ICR1）、プリスケーラ8

  // 割り込み許可
  TIMSK1 = (1 << ICIE1) | (1 << TOIE1);
  sei();  //割り込み有効化
}

void loop() {
  freq = min(freq + 0.004, 100);
  modulation_index = freq / 70;
  sigwave_index_increment = (uint16_t)(freq / 2 / carrier_freq * SIN_LENGTH);
  delay(1);  //ひとまずテスト用なので厳密性は問わない
}

void update_duties_and_set_ocr() {
  sigwave_index = (sigwave_index + sigwave_index_increment) & (SIN_LENGTH - 1);

  //デューティー計算
  float duty_u = (((float)(pgm_read_byte_near(&SIN_U[sigwave_index]) - LUT_ZERO_LEVEL) * modulation_index / 127 + 0.5f));
  float duty_v = (((float)(pgm_read_byte_near(&SIN_V[sigwave_index]) - LUT_ZERO_LEVEL) * modulation_index / 127 + 0.5f));
  float duty_w = (((float)(pgm_read_byte_near(&SIN_W[sigwave_index]) - LUT_ZERO_LEVEL) * modulation_index / 127 + 0.5f));

  // 過変調してもタイマがぶっこわれないように制限
  duty_u = max(min(duty_u, 1), 0);
  duty_v = max(min(duty_v, 1), 0);
  duty_w = max(min(duty_w, 1), 0);

  // 出力コンペアレジスタに設定
  OCR1A = (uint16_t)(duty_u * top);
  OCR1B = (uint16_t)(duty_v * top);
  OCR1C = (uint16_t)(duty_w * top);
  // TOP値を設定
  ICR1 = top;
}

// カウンタがBOTTOM（谷）に達したとき
ISR(TIMER1_OVF_vect) {
  update_duties_and_set_ocr();
  TCCR1A = 0b10101010;  // 次の更新はTOP（山）
}

// カウンタがTOP（山）に達したとき
ISR(TIMER1_CAPT_vect) {
  update_duties_and_set_ocr();
  TCCR1A = 0b10101000;  // 次の更新はBOTTOM（谷）
}
